## Plan Result (netbox_ptlsbox)




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault.netbox_key_vault
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.redis_accesskey
  * azurerm_key_vault_secret.redis_hostname
  * azurerm_key_vault_secret.redis_port
  * azurerm_resource_group.netbox_rg
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;netbox&#34;]
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.netbox_key_vault will be created
  + resource "azurerm_key_vault" "netbox_key_vault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "netbox-vault-ptlsbox"
      + public_network_access_enabled = true
      + resource_group_name           = "netbox-ptlsbox-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = (known after apply)
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-DATABASE-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_accesskey will be created
  + resource "azurerm_key_vault_secret" "redis_accesskey" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-accesskey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_hostname will be created
  + resource "azurerm_key_vault_secret" "redis_hostname" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-hostname"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "netbox-redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.netbox_rg will be created
  + resource "azurerm_resource_group" "netbox_rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "netbox-ptlsbox-rg"
      + tags     = (known after apply)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptlsbox-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "netbox-v14-flexible-ptlsbox"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "netbox-ptlsbox-rg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = (known after apply)
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "netbox-ptlsbox-rg"
      + server_name         = "netbox-v14-flexible-ptlsbox"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["netbox"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "netbox"
      + server_id = (known after apply)
    }

  # module.redis.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "netbox-ptlsbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "netbox-ptlsbox-rg"
      + subnet_id                = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptlsbox-vnet/subnets/iaas"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "netbox-ptlsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "netbox-ptlsbox"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "netbox-ptlsbox-rg"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = (known after apply)

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_key_vault.netbox_key_vault has been deleted
  - resource "azurerm_key_vault" "netbox_key_vault" {
      - id                              = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/netbox-vault-ptlsbox" -> null
        name                            = "netbox-vault-ptlsbox"
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/rdo-netbox"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-07-27"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.netbox_rg has been deleted
  - resource "azurerm_resource_group" "netbox_rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg"
      - name     = "netbox-ptlsbox-rg" -> null
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/rdo-netbox"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-07-27"
        }
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server has been deleted
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "pgadmin" -> null
      - administrator_password        = (sensitive value) -> null
      - fqdn                          = "netbox-v14-flexible-ptlsbox.postgres.database.azure.com" -> null
      - id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/netbox-v14-flexible-ptlsbox" -> null
      - name                          = "netbox-v14-flexible-ptlsbox" -> null
      - resource_group_name           = "netbox-ptlsbox-rg" -> null
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/rdo-netbox"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-07-27"
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.redis.azurerm_redis_cache.redis has been deleted
  - resource "azurerm_redis_cache" "redis" {
      - hostname                      = "netbox-ptlsbox.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/netbox-ptlsbox-rg/providers/Microsoft.Cache/redis/netbox-ptlsbox" -> null
        name                          = "netbox-ptlsbox"
      - primary_access_key            = (sensitive value) -> null
      - ssl_port                      = 6380 -> null
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/rdo-netbox"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-07-27"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":26,"Program":"tfcmt","SHA1":"","Target":"netbox_ptlsbox","Vars":{}} -->